IDEA StatiCa Open Model
ReinforcedBar.Diameter Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Diameter
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double Diameter { get; set; }
Public Property Diameter As Double
	Get
	Set
public:
property double Diameter {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
ReinforcedBar Class
IdeaRS.OpenModel.CrossSection Namespace